В этом домашнем задании мы будем работать с набором данных о пассажирах парохода "Титаник", потерпевшего крушение в 1912 году (источник: соревнование [Titanic: Machine Learning from Disaster](https://www.kaggle.com/c/titanic) на платформе [Kaggle](https://www.kaggle.com)).

# Базовый уровень

## Задание 1.1
Загрузите таблицу из файла `data.csv` в переменную `df` типа `pd.DataFrame`. В качестве индекса следует использовать колонку `PassengerId`.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../titanic.csv', sep=',', index_col='PassengerId')

## Задание 1.2
Сколько строк и столбцов в таблице?

In [3]:
df.shape

(891, 11)

## Задание 1.3
Выведите на экран последние три значения столбца `Age`(возраст).

In [4]:
df.Age.tail(3)

PassengerId
889     NaN
890    26.0
891    32.0
Name: Age, dtype: float64

## Задание 1.4

Какова доля выживших (поле `Survived`)?

In [5]:
df.Survived.mean()

0.38383838383838381

## Задание 1.5
Выведите на экран таблицу, отсортированную по имени по алфавиту (поле `Name`).

In [6]:
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 10)

In [7]:
df.sort_values('Name')

,Survived,Pclass,Name,Sex,Age,...,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
846,0,3,"Abbing, Mr. Anthony",male,42.0,...,0,C.A. 5547,7.5500,NaN,S
747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,...,1,C.A. 2673,20.2500,NaN,S
280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,...,1,C.A. 2673,20.2500,NaN,S
309,0,2,"Abelson, Mr. Samuel",male,30.0,...,0,P/PP 3381,24.0000,NaN,C
875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,...,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
287,1,3,"de Mulder, Mr. Theodore",male,30.0,...,0,345774,9.5000,NaN,S
283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,...,0,345778,9.5000,NaN,S
362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,...,0,SC/PARIS 2167,27.7208,NaN,C
154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,...,2,A/5. 851,14.5000,NaN,S
869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,...,0,345777,9.5000,NaN,S

## Задание 1.6
Каковы доли женщин и мужчин среди пассажиров (поле `Sex`)?

In [8]:
df.Sex.value_counts(normalize=True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

# Продвинутый уровень

## Задание 2.1
Каков процент женщин и мужчин среди пассажиров? (Hint: *процент – это доля, умноженная на 100.*)

In [9]:
100.0 * df.Sex.value_counts(normalize=True)

male      64.758698
female    35.241302
Name: Sex, dtype: float64

## Задание 2.2
Какова доля совершеннолетних пассажиров (18 лет и старше)?

In [10]:
(df.Age >= 18).mean()

0.67452300785634123

## Задание 2.3
Замените коды пассажирских классов (поле `Pclass`) их названиями (1 = Upper, 2 = Middle, 3 = Lower). Результат выведите на экран.

In [11]:
df.replace({'Pclass' : {1 : 'Upper', 2 : 'Middle', 3 : "Lower"}})

,Survived,Pclass,Name,Sex,Age,...,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,Lower,"Braund, Mr. Owen Harris",male,22.0,...,0,A/5 21171,7.2500,NaN,S
2,1,Upper,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,...,0,PC 17599,71.2833,C85,C
3,1,Lower,"Heikkinen, Miss. Laina",female,26.0,...,0,STON/O2. 3101282,7.9250,NaN,S
4,1,Upper,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,...,0,113803,53.1000,C123,S
5,0,Lower,"Allen, Mr. William Henry",male,35.0,...,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,Middle,"Montvila, Rev. Juozas",male,27.0,...,0,211536,13.0000,NaN,S
888,1,Upper,"Graham, Miss. Margaret Edith",female,19.0,...,0,112053,30.0000,B42,S
889,0,Lower,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,...,2,W./C. 6607,23.4500,NaN,S
890,1,Upper,"Behr, Mr. Karl Howell",male,26.0,...,0,111369,30.0000,C148,C
891,0,Lower,"Dooley, Mr. Patrick",male,32.0,...,0,370376,7.7500,NaN,Q

## Задача 2.4
Какова доля выживших среди женщин? Среди мужчин?

In [12]:
df.loc[df.Sex == 'female', 'Survived'].mean()

0.7420382165605095

In [13]:
df.loc[df.Sex == 'male', 'Survived'].mean()

0.18890814558058924

## Задача 2.5
Сколько всего пропущенных значений в таблице?

In [14]:
df.isnull().sum().sum()

866

# Сложный уровень

## Задание 3.1
Добавьте в таблицу поле `Surname` – фамилию пассажира.

In [15]:
# df['Surname'] = df.Name.str.split(',').str[0]  # vectorized variant
df['Surname'] = df.Name.apply(lambda s: s.split(',')[0])

## Задание 3.2
Найдите всех пассажиров с аномальной стоимостью билета (поле `Fare`). Будем считать стоимость аномальной, если она отличается от среднего более, чем на 5 стандартных отклонений. Выведите соответствующие строки таблицы на экран.

In [16]:
df.loc[(df.Fare - df.Fare.mean()).abs() / df.Fare.std() > 5]

,Survived,Pclass,Name,Sex,Age,...,Ticket,Fare,Cabin,Embarked,Surname
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,...,PC 17755,512.3292,NaN,C,Ward
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,...,PC 17755,512.3292,B51 B53 B55,C,Cardeza
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,...,PC 17755,512.3292,B101,C,Lesurer

## Задание 3.3
Выведите на экран столбцы, в которых бывают пропущенные значения. (Hint: *Здесь может помочь метод* `.any()`*, а также индексация переменной* `df.columns`).

In [17]:
df.columns[df.isnull().any()].tolist()

['Age', 'Cabin', 'Embarked']

In [18]:
df.loc[:, df.isnull().any()]

              Age Cabin Embarked
PassengerId
1            22.0   NaN        S
2            38.0   C85        C
3            26.0   NaN        S
4            35.0  C123        S
5            35.0   NaN        S
...           ...   ...      ...
887          27.0   NaN        S
888          19.0   B42        S
889           NaN   NaN        S
890          26.0  C148        C
891          32.0   NaN        Q

[891 rows x 3 columns]